In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
from numpy import nan as NA

In [5]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [8]:
cleaned = data.dropna()

In [9]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
df = pd.DataFrame(np.random.randn(7, 3))

In [13]:
df.iloc[:4, 1] = NA

In [14]:
df.iloc[:2, 2] = NA

In [15]:
df

          0         1         2
0  2.591492       NaN       NaN
1 -0.482443       NaN       NaN
2  1.270487       NaN  0.128448
3  0.258873       NaN -0.917487
4  1.032310  0.673957  0.467931
5 -1.250259  0.456332 -1.119274
6  0.066013 -0.688315 -0.530726

In [16]:
df.dropna()

          0         1         2
4  1.032310  0.673957  0.467931
5 -1.250259  0.456332 -1.119274
6  0.066013 -0.688315 -0.530726

In [17]:
df.fillna(0)

          0         1         2
0  2.591492  0.000000  0.000000
1 -0.482443  0.000000  0.000000
2  1.270487  0.000000  0.128448
3  0.258873  0.000000 -0.917487
4  1.032310  0.673957  0.467931
5 -1.250259  0.456332 -1.119274
6  0.066013 -0.688315 -0.530726

In [18]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [19]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [20]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [21]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [22]:
data['v1'] = range(7)

In [23]:
data['v1']

0    0
1    1
2    2
3    3
4    4
5    5
6    6
Name: v1, dtype: int64

In [24]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [25]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [26]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [27]:
lowercased = data['food'].str.lower()

In [28]:
data['animal'] = lowercased.map(meat_to_animal)

In [29]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [30]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [31]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [32]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [33]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [34]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [35]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [36]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
....: index=['Ohio', 'Colorado', 'New York'],
....: columns=['one', 'two', 'three', 'four'])

In [37]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [38]:
transform = lambda x: x[:4].upper()

In [39]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [40]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [41]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [42]:
data.index = data.index.map(transform)

In [43]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [44]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [45]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [46]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [47]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [48]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0   -0.939626 -0.077912 -0.245990  0.473250
1    1.689922 -1.312254  0.757099 -0.734445
2    1.260278  1.497275  0.224562 -0.852996
3    0.066235 -1.108395 -0.713986 -0.471338
4    0.007027 -0.264078 -0.721266  0.421294
..        ...       ...       ...       ...
995 -0.281007 -1.327288 -0.119752 -0.531433
996 -0.100722  0.540458 -0.673881 -0.430218
997  1.987001  1.423556 -1.824976  2.127895
998  0.813426 -1.802241  0.238848 -0.354330
999 -2.207556 -0.074054  0.434005  0.609033

[1000 rows x 4 columns]

In [49]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.003884     0.020417     0.017990     0.001993
std       1.009561     1.044359     1.014999     1.014356
min      -3.300883    -3.700305    -3.363850    -2.940813
25%      -0.629673    -0.636906    -0.696679    -0.707253
50%       0.007014     0.001456     0.020088     0.012700
75%       0.682766     0.654214     0.707992     0.705207
max       2.730344     3.052517     3.290047     3.302602

In [50]:
# IMPORTANTE

In [51]:
col = data[2]

In [52]:
col[np.abs(col) > 3]

25     3.290047
52    -3.363850
376    3.069218
584   -3.180478
Name: 2, dtype: float64

In [61]:
data[np.abs(data) > 3]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
..   ..  ..  ..  ..
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [62]:
data

            0         1         2         3
0   -0.939626 -0.077912 -0.245990  0.473250
1    1.689922 -1.312254  0.757099 -0.734445
2    1.260278  1.497275  0.224562 -0.852996
3    0.066235 -1.108395 -0.713986 -0.471338
4    0.007027 -0.264078 -0.721266  0.421294
..        ...       ...       ...       ...
995 -0.281007 -1.327288 -0.119752 -0.531433
996 -0.100722  0.540458 -0.673881 -0.430218
997  1.987001  1.423556 -1.824976  2.127895
998  0.813426 -1.802241  0.238848 -0.354330
999 -2.207556 -0.074054  0.434005  0.609033

[1000 rows x 4 columns]

In [63]:
data[(np.abs(data) > 3).any([1])]

TypeError: NDFrame._add_numeric_operations.<locals>.any() takes 1 positional argument but 2 were given

In [64]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [65]:
data

            0         1         2         3
0   -0.939626 -0.077912 -0.245990  0.473250
1    1.689922 -1.312254  0.757099 -0.734445
2    1.260278  1.497275  0.224562 -0.852996
3    0.066235 -1.108395 -0.713986 -0.471338
4    0.007027 -0.264078 -0.721266  0.421294
..        ...       ...       ...       ...
995 -0.281007 -1.327288 -0.119752 -0.531433
996 -0.100722  0.540458 -0.673881 -0.430218
997  1.987001  1.423556 -1.824976  2.127895
998  0.813426 -1.802241  0.238848 -0.354330
999 -2.207556 -0.074054  0.434005  0.609033

[1000 rows x 4 columns]

In [66]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.003570     0.021200     0.018175     0.001690
std       1.008583     1.041461     1.012194     1.013415
min      -3.000000    -3.000000    -3.000000    -2.940813
25%      -0.629673    -0.636906    -0.696679    -0.707253
50%       0.007014     0.001456     0.020088     0.012700
75%       0.682766     0.654214     0.707992     0.705207
max       2.730344     3.000000     3.000000     3.000000